Revit 2026 API

# ColorBackgroundSettings Properties

---

The ColorBackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Color | The color of the rendering background. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from BackgroundSettings) |

#### Reference

ColorBackgroundSettings Class

Autodesk.Revit.DB Namespace